// Добавить индикаторы загрузки через redux/toolkit
// Добавить обработку ошибок
// todo - +++ Добавить онлайн/офлайн отображение
// todo - +++ Регистрация (переход на страницу логина)
//        +++ - Логин ( записываем токен в локал сторэдж в стэйт записываем пользователя)
//        +++  - Закр/откр. сайт -> Проверяем есть ли токен, если нет - то мы не залогинены.
//        +++    - Если есть, то getCurrentUser, отображаем залогиненого пользователя прописываем его в стор.
//        +++      - Log Out убираем из локал сторэдж токен авторизации, очищаем данные пользователя в стэйте
// todo - +++ Сделать страницу логина
// todo - +++ Сделать страницу редактирования пользователя

// v2.2.2
// todo - +++ Сделать отображение страниц в url
// todo - Сделать функции лайк/дизлайк

// v2.3.2
// todo - Пройдись по всем ошибкам в запросах, сделай отображение компонента alert из AntD
// todo - Добавь модальное окно при удалении
// todo - Сделать страницу редактирования статьи
